Revit 2026 API

# IFCAggregateGetEnumerator Method

---

Returns an enumerator that iterates through a collection.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual IEnumerator<IFCData> GetEnumerator()
```
```vb
Public Overridable Function GetEnumerator As IEnumerator(Of IFCData)
```
```cpp
public:
virtual IEnumerator<IFCData^>^ GetEnumerator()
```
```fsharp
abstract GetEnumerator : unit -> IEnumerator<IFCData>
override GetEnumerator : unit -> IEnumerator<IFCData>
```

#### Return Value

IEnumeratorIFCDataAn IEnumerator object that can be used to iterate through the collection.

#### Implements

IEnumerableTGetEnumerator

#### Reference

IFCAggregate Class

Autodesk.Revit.DB.IFC Namespace